Управление_торговлей.ПБТ/src/Documents/УдостоверениеКачества/УдостоверениеКачества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УдостоверениеКачества</name>
  <basedOn>Document.ПротоколАнализа</basedOn>
  <registerRecords>AccumulationRegister.ОтборОбразцов</registerRecords>
  <registerRecords>InformationRegister.СтатусыОбразцов</registerRecords>
  <attributes>
    <name>ДатаИзготовления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПоступления</name>
    <type>
      <types>DocumentRef.АктОтбора</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПродукта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Технолог</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗамеса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСертификатаХаляль</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Декларация</name>
    <type>
      <types>CatalogRef.СертификатыНоменклатуры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧ_Показатели</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.Нормативы</types>
      </type>
    </attributes>
    <attributes>
      <name>НаАнглийском</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоТУ</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантСравнения</name>
      <type>
        <types>EnumRef.ВариантыСравнения</types>
      </type>
    </attributes>
    <attributes>
      <name>Интервал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидИсследования</name>
      <type>
        <types>CatalogRef.ВидыИсследований</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧ_ПротоколыАнализа</name>
    <attributes>
      <name>ПротоколАнализа</name>
      <type>
        <types>DocumentRef.ПротоколАнализа</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей.ПБТ/src/Documents/УдостоверениеКачества/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ОтборОбразцов Расход
	//Движение = Движения.ОтборОбразцов.Добавить();
	//Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//Движение.Период = Дата;
	//
	//Движение.Номенклатура = Номенклатура;
	//Движение.ДокументПоступления = ДокументПоступления;
	//Движение.КодПродукта = КодПродукта;
	//Движение.ВидДокумента = Перечисления.лаб_ВидыДокументов.УдостоверениеКачества;
	//Движение.Организация = Организация;
	//Движение.Количество = 1;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат;
	КонецЕсли; 	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПротоколАнализа") Тогда
		Организация = ДанныеЗаполнения.Организация;
		Образец = ДанныеЗаполнения.Образец;
		ДатаИзготовления = Образец.ДатаИзготовления; 
		ДокументПоступления = Образец.ДокументПоступления; 
		КодПродукта = Образец.КодПродукта; 
		Номенклатура = ДанныеЗаполнения.Номенклатура; 
		Серия = ДанныеЗаполнения.Серия; 
		Производитель = ДанныеЗаполнения.Производитель; 
		НомерЗамеса = Образец.НомерЗамеса;
		Пользователь = Пользователи.ТекущийПользователь();//глЗначениеПеременной("глТекущийПользователь");
	КонецЕсли;
	
	//Заполнение табличных частей
	лТЗПротоколов = Лаборатория_Сервер.гл_ПолучитьТаблицуПротоколов(Номенклатура, Серия);
	ТЧ_ПротоколыАнализа.Загрузить(лТЗПротоколов);
	//лТЗШаблон = Лаборатория_Сервер.гл_ПолучитШаблонныеДанные(Номенклатура, ТекущаяДатаСеанса());
	//ТаблицаВидовИсследования(ТЗПротоколов, лТЗШаблон);
	//лТЗПротоколов = ПротоколыСрезПоследних(ТЗПротоколов);
	//ТЧ_ПротоколыАнализа.Очистить();
	Документы.УдостоверениеКачества.ЗаполнениеТаблиц(ЭтотОбъект);
	
	Если Номенклатура.Ссылка <> справочники.Номенклатура.ПустаяСсылка() тогда
		НоменклатураНаПечать = Номенклатура.НаименованиеПолное ;//+ Символы.ПС + "ТУ " + Номенклатура.ТУ;
	КонецЕсли;	
	
КонецПроцедуры


Функция ОтборПоПараметру(парам_ТЗ, парам_Ключ, парам_Значение) Экспорт
	Отбор = Новый Структура();
	Отбор.Вставить(парам_Ключ, парам_Значение);
	Результат = парам_ТЗ.НайтиСтроки(Отбор);
	Возврат  Результат;
КонецФункции // ОтборПоПараметру()

Процедура ТаблицаВидовИсследования(ТЗПротоколов, ТЗШаблоны) Экспорт
	
	//Убираем протоколы по которым есть шаблоны на регистре
	ТЗВидыИсследований = Новый ТаблицаЗначений;
	ТЗВидыИсследований.Колонки.Добавить("ВидИсследования");
	Для Н=1 По ТЗШаблоны.Количество() Цикл
		ТЗВидыИсследований.Добавить();
	КонецЦикла;
	СтрокиТЗ = ОтборПоПараметру(ТЗПротоколов, "ВидИсследования", Справочники.ВидыИсследований.ФункциональныеСвойства);
	Если СтрокиТЗ.Количество()>0  Тогда 
		Для каждого Строка Из СтрокиТЗ Цикл
			ТЗПротоколов.Удалить(Строка);
		КонецЦикла; 
	КонецЕсли;
	СтрокиТЗ = "";
	Если ТЗШаблоны.Количество()>0 Тогда
		ТЗВидыИсследований.ЗагрузитьКолонку(ТЗШаблоны.ВыгрузитьКолонку("ВидИсследования"), "ВидИсследования");
		ТЗВидыИсследований.Свернуть("ВидИсследования");
		Для каждого Элемент Из  ТЗВидыИсследований Цикл
			//Отбор = Новый Структура();
			//Отбор.Вставить("ВидИсследования", Элемент.ВидИсследования);
			//СтрокиТЗ = ТЗПротоколов.НайтиСтроки(Отбор);
			СтрокиТЗ = ОтборПоПараметру(ТЗПротоколов, "ВидИсследования", Элемент.ВидИсследования);
			Если СтрокиТЗ.Количество()>0 Тогда
				#Если Клиент Тогда
					Ответ = Вопрос("Для вида исследований "+Элемент.ВидИсследования.Наименование+" найдены шаблонные данные, удалить соответствующие Протоколы анализа?", РежимДиалогаВопрос.ДаНет);
					Если Ответ = КодВозвратаДиалога.Да Тогда
						Для каждого Строка Из СтрокиТЗ Цикл
							ТЗПротоколов.Удалить(Строка);
						КонецЦикла; 
					Иначе
						СтрокиВИ = ОтборПоПараметру(ТЗШаблоны, "ВидИсследования", Элемент.ВидИсследования);
						Для каждого лСтрВИ Из СтрокиВИ Цикл
							ТЗШаблоны.Удалить(лСтрВИ);			
						КонецЦикла; 			
					КонецЕсли;
				#КонецЕсли
			КонецЕсли;
			
			Если ТЗПротоколов.Количество()=0 Тогда
				Прервать;
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли;
	
	Возврат ;	
	
КонецПроцедуры
